Revit 2027 API
ParameterTypeId.SymbolNameParam Property
 "Type Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SymbolNameParam { get; }
Public Shared ReadOnly Property SymbolNameParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SymbolNameParam {
	ForgeTypeId^ get ();
}
static member SymbolNameParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace